# BasepointNorthsouthParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BasepointNorthsouthParam Property
ParameterTypeId Class See Also
---
"N/S"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BasepointNorthsouthParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BasepointNorthsouthParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BasepointNorthsouthParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace